# MullionProfile Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..MullionProfile Property
ParameterTypeId Class See Also
---
"Profile"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId MullionProfile { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property MullionProfile As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ MullionProfile {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace